      * COBOL UT WORKING STORAGE
         01  DUT-DATA.
           05 DUT-NUM-ACTUAL   PIC 9(18).
           05 DUT-NUM-EXPECTED PIC 9(18).
           05 DUT-CHAR-ACTUAL  PIC X(100).
           05 DUT-CHAR-EXPECTED PIC X(100).
           05 DUT-MESSAGE      PIC X(100).
           05 DUT-TEST-NAME    PIC X(100).
           05 DUT-TEST-PASS-COUNT PIC 9(9).
           05 DUT-TEST-PASS-COUNT-DISPLAY PIC Z(8)9.
           05 DUT-TEST-FAIL-COUNT PIC 9(9).
           05 DUT-TEST-FAIL-COUNT-DISPLAY PIC Z(8)9.
           05 DUT-TEST-SKIP-COUNT-DISPLAY PIC Z(8)9.
           05 DUT-TEST-SKIP-COUNT PIC 9(9).
           05 DUT-TEST-STATUS  PIC X(1) VALUE 'F'.
              88 DUT-TEST-FAIL VALUE 'F'.
              88 DUT-TEST-PASS VALUE 'P'.
              88 DUT-TEST-SKIP VALUE 'S'.
           05 DUT-SECTION-SEARCH-STATUS PIC X.
              88 DUT-SECTION-FOUND VALUE 'Y'.
              88 DUT-SECTION-NOT-FOUND VALUE 'N'.
           05 DUT-FIELD-SEARCH-STATUS PIC X.
              88 DUT-FIELD-FOUND VALUE 'Y'.
              88 DUT-FIELD-NOT-FOUND VALUE 'N'.

       01  DUT-DISPLAYS.
           05 DUT-DISPLAY-ERROR.
              10 FILLER PIC X(7) VALUE '[FAIL] '.
              10 DUT-DISPLAY-ERROR-MSG PIC X(150).
           05 DUT-DISPLAY-PASS.
              10 FILLER PIC X(7) VALUE '[PASS] '.
              10 DUT-DISPLAY-PASS-MSG PIC X(150).
           05 DUT-DISPLAY-SKIP.
              10 FILLER PIC X(7) VALUE '[SKIP] '.
              10 DUT-DISPLAY-SKIP-MSG PIC X(150).


       01  DUT-EXEC-TRACE.
           05 DUT-TRACE PIC X(1000). *> THE ACTUAL COMMAND
           05 DUT-TRACE-WORD-COUNT PIC 9(2) VALUE 0. 
           05 DUT-TRACE-TEMP-WORD  PIC X(31) VALUE SPACES.
           05 DUT-TRACE-POINTER    PIC 9(4) COMP VALUE 1.
           05 DUT-TRACE-FIELD-INDEX PIC 9(3) VALUE 1.
           05 DUT-TRACE-SECTION-INDEX PIC 9(3) VALUE 1.
           05 DUT-TEMP-SECTION-NAME PIC X(30) VALUE SPACES.
           05 DUT-TEMP-FIELD-NAME   PIC X(30) VALUE SPACES.
           05 DUT-TEMP-FIELD-VALUE  PIC X(30) VALUE SPACES.
           05 DUT-TEMP-FIELD-EXPECTED PIC X(30) VALUE SPACES.
           05 DUT-TEMP-FIELD-OPERATOR PIC X(2) VALUE SPACES.
           05 DUT-RT-SECTION-COUNT PIC 9(3) VALUE 1.
           05 DUT-EXEC-TRACE-INDEX PIC 9(3) VALUE 1. *> ITERATE EXEC CMD
           05 DUT-EXEC-TRACE-OCCURS. *> THE COMMAND SPLIT INTO WORDS
              10 DUT-EXEC-TRACE-WORD PIC X(30) OCCURS 50 TIMES.

           05 DUT-RT-TRACE OCCURS 100 TIMES. *> UP TO 100 SECTIONS
              10 DUT-RT-SECTION-NAME PIC X(30) VALUE SPACES.
              10 DUT-RT-SECTION-FIELD-COUNT PIC 9(3) VALUE 1.
              10 DUT-RT-SECTION-FIELDS OCCURS 100 TIMES. *> UP TO 100
                                                  *> FIELDS PER SECTION
                 15 DUT-RT-SECTION-FIELD-NAME PIC X(30) VALUE SPACES.
                 15 DUT-RT-SECTION-FIELD-VALUE PIC X(30) VALUE SPACES.
       
       
       01  DUT-FILED-EXPECT.
           05 DUT-FIELDS-TO-TRACE PIC X(1000).
           05 DUT-EXPECT PIC X(1000).
           05 DUT-EXPECT-WORD-COUNT PIC 9(2) VALUE 0. 
           05 DUT-EXPECT-TEMP-WORD  PIC X(31).
           05 DUT-EXPECT-POINTER    PIC 9(4) COMP VALUE 1.
           05 DUT-EXPECT-OCCURS.
              10 DUT-EXPECT-WORD PIC X(30) OCCURS 50 TIMES.      


       01  DUT-ASSERT-FIELDS.
           05 DUT-ASSERT-TARGET PIC X(30) VALUE SPACES. 
           05 DUT-ASSERT-ACTUAL PIC X(30) VALUE SPACES.


