      * COBOL UT DATA DIVISION

      * SPDX-License-Identifier: GPL-3.0-or-later
      * SPDX-FileCopyrightText: 2026 MaxwellAD

      * UNIT TEST REPORT OUTPUT FILE
       FILE SECTION.
       FD  CUT-OUT RECORDING MODE F.
       01 CUT-OUT-RECORD PIC X(160).
