      * COBOL UT ENVIRONMENT DIVISION

      * SPDX-License-Identifier: GPL-3.0-or-later
      * SPDX-FileCopyrightText: 2026 MaxwellAD

      * UNIT TEST REPORT OUTPUT FILE
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CUT-OUT ASSIGN TO CUT-RPTO
           ORGANIZATION IS LINE SEQUENTIAL.
